#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_service_principal.spn: Reading...
data.azuread_service_principal.spn: Read complete after 0s [id=e5bbc612-b308-4098-9717-52b0711bcbed]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04ZmNiODUzNC1hYzdjLTQ5YjktYjU0Ni03ODMxYjM5NWY0MWY7b2JqZWN0SWQ9OTQxODAxMmItOTJmMS00ODI4LTgyYWYtMTk1YjIyYmJhY2E4O3N1YnNjcmlwdGlvbklkPWRjOWI1MTU3LTRlZTgtNGE1Ni04NzcyLWZjZjQ4MDYzMmUwYTt0ZW5hbnRJZD1kMjJkYjAxMS1jYjgyLTQ5NjEtOTZmMC1iOTMyNWY3ZWJiZTM=]
azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Storage/storageAccounts/esgeinsteindev]
azurerm_mssql_server.mssql_server: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Sql/servers/sqlserver-esg-einstein-dev]
azurerm_service_plan.app_service_plan: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Web/serverfarms/service-plan-esg-einstein-dev]
azurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.DataFactory/factories/data-factory-esg-einstein-dev]
azurerm_mssql_database.mssql_database: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Sql/servers/sqlserver-esg-einstein-dev/databases/sqldatabase-esg-einstein-dev]
azurerm_logic_app_standard.logic_app: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Web/sites/logic-app-esg-einstein-dev]
azurerm_advanced_threat_protection.advanced_threat_protection: Refreshing state... [id=/subscriptions/dc9b5157-4ee8-4a56-8772-fcf480632e0a/resourceGroups/rg-esg-einstein-dev/providers/Microsoft.Storage/storageAccounts/esgeinsteindev/providers/Microsoft.Security/advancedThreatProtectionSettings/current]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault.key_vault will be created
  + resource "azurerm_key_vault" "key_vault" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "francecentral"
      + name                          = "keyvaultesgeinsteindev"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-esg-einstein-dev"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "d22db011-cb82-4961-96f0-b9325f7ebbe3"
      + vault_uri                     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @vmisson, Action: `pull_request`*